yasunorioi/tab5-caster/sdkconfig.defaults
# sdkconfig.defaults — baseline for ESP32-P4 / Tab5.
# Verify/adjust the rest via `idf.py menuconfig` on real hardware.

CONFIG_IDF_TARGET="esp32p4"

# ── PSRAM (Tab5 = 32MB) ───────────────────────────────────────────────────
# Thread-per-connection needs room: ~15 conn x ~8KB task stacks + ring buffers.
# TODO(hw): confirm exact P4/Tab5 PSRAM Kconfig keys in menuconfig (mode/speed).
CONFIG_SPIRAM=y

# ── lwIP: raise socket ceiling ────────────────────────────────────────────
# Sockets != rovers. Budget = caster listener + admin listener + fkp upstream
# + base source(s) + N rovers. For the 5-10 rover target, 24 leaves headroom.
CONFIG_LWIP_MAX_SOCKETS=24

# ── FreeRTOS ──────────────────────────────────────────────────────────────
CONFIG_FREERTOS_HZ=1000

# ── Console ───────────────────────────────────────────────────────────────
# Headless product: no UART header wired. Put the primary console (boot log +
# esp_console REPL) on the USB-Serial/JTAG controller so everything comes out
# the USB-C port on /dev/ttyACM*. This also makes debug_console.c compile its
# usb_serial_jtag REPL path instead of the UART one.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ── USB Host ──────────────────────────────────────────────────────────────
# The usb_host library is pulled in as a component; host mode on the P4 HS OTG
# is configured at runtime (usb_host_install). No single Kconfig toggle here.
# TODO(hw): confirm which Tab5 connector is wired to the HS OTG host PHY and how
# VBUS is supplied to the Mosaic (bus-power vs external).

# ── WiFi via ESP32-C6 over SDIO (ESP-Hosted) ──────────────────────────────
# The P4 has no radio; the onboard C6 does WiFi, reached over SDIO2. Pins +
# reset GPIO are Tab5-specific (from M5Tab5-UserDemo). The C6 runs the factory
# ESP-Hosted slave firmware — do not change the component versions without also
# reflashing the C6.
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
# Slave co-processor = C6. This is the real knob (esp_wifi_remote's slave-select
# choice); it drives ESP_HOSTED_IDF_SLAVE_TARGET. Without it the host defaults to
# expecting an esp32 slave and aborts: "Identified slave [esp32c6] != [esp32]".
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
# D1 in 4-bit mode is the PRIV_..._4BIT_BUS knob (the plain PIN_D1 is a derived,
# non-overridable symbol). Its P4 default is 15 — which collides with the reset
# GPIO and kills the SDIO bus ("failed to get CIS data"). Tab5 wires D1 to 10.
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_RESET_GPIO_ACTIVE_LOW=y
